ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/MCSPI_MCSPI_52200000h.xml
<module name="MCSPI" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MCSPI_HL_REV" acronym="MCSPI_HL_REV" offset="0" width="32" description="IP Revision Identifier (X.Y.R)Used by software to track features, bugs, and compatibility.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish between old scheme and current" range="31:30" rwaccess="R"/>
	<bitfield id="RSVD" width="2" begin="29" end="28" resetval="0x0" description="Reserved These bits are initialized to zero, and writes to them are ignored" range="29:28" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x48" description="Function indicates a software compatible module family If there is no level of software compatibility a new Func number [and hence REVISION] should be assigned" range="27:16" rwaccess="R"/>
	<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x3" description="RTL Version [R], maintained by IP design owner RTL follows a numbering such as XYRZ which are explained in this table R changes ONLY when: [1] PDS uploads occur which may have been due to spec changes [2] Bug fixes occur [3] Resets to '0' when X or Y changes Design team has an internal 'Z' [customer invisible] number which increments on every drop that happens due to DV and RTL updates Z resets to 0 when R increments" range="15:11" rwaccess="R"/>
	<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Major Revision [X], maintained by IP specification owner X changes ONLY when: [1] There is a major feature addition An example would be adding Master Mode to Utopia Level2 The Func field [or Class/Type in old PID format] will remain the same X does NOT change due to: [1] Bug fixes [2] Change in feature parameters" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Indicates a special version for a particular device Consequence of use may avoid use of standard Chip Support Library [CSL] / Drivers" range="7:6" rwaccess="R"/>
	<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x11" description="Minor Revision [Y], maintained by IP specification owner Y changes ONLY when: [1] Features are scaled [up or down] Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available [2] When feature creeps from Is-Not list to Is list But this may not be the case once it sees silicon; in which case X will change Y does NOT change due to: [1] Bug fixes [2] Typos or clarifications [3] major functional/feature change/addition/deletion Instead these changes may be reflected via R, S, X as applicable Spec owner maintains a customer-invisible number 'S' which changes due to: [1] Typos/clarifications [2] Bug documentation Note that this bug is not due to a spec change but due to implementation Nevertheless, the spec tracks the IP bugs An RTL release [say for silicon PG11] that occurs due to bug fix should document the corresponding spec number [XYS] in its release notes" range="5:0" rwaccess="R"/>
	</register><register id="MCSPI_HL_HWINFO" acronym="MCSPI_HL_HWINFO" offset="4" width="32" description="Information about the IP module's hardware configuration, i.e. typically the module's HDL generics (if any).Actual field format and encoding is up to the module's designer to decide.">
		<bitfield id="RSVD" width="25" begin="31" end="7" resetval="0x0" description="Reserved These bits are initialized to zero, and writes to them are ignored" range="31:7" rwaccess="R"/>
	<bitfield id="RETMODE" width="1" begin="6" end="6" resetval="0x0" description="This bit field indicates whether the retention mode is supported using the pin PIRFFRET 0      Retention mode disabled1      Retention mode enabled" range="6" rwaccess="R"/>
	<bitfield id="FFNBYTE" width="5" begin="5" end="1" resetval="0x4" description="FIFO number of byte generic parameter This register defines the value of FFNBYTE generic parameter, only MSB bits from 8 down to 4 are taken into account 1      FIFO 16 bytes depth2      FIFO 32 bytes depth4      FIFO 64 bytes depth8      FIFO 128 bytes depth10     FIFO 256 bytes depth" range="5:1" rwaccess="R"/>
	<bitfield id="USEFIFO" width="1" begin="0" end="0" resetval="0x1" description="Use of a FIFO enable: This bit field indicates if a FIFO is integrated within controller design with its management 0      FIFO not implemented in design1      FIFO and its management implemented in       design with depth defined by FFNBYTE       generic" range="0" rwaccess="R"/>
	</register><register id="MCSPI_HL_SYSCONFIG" acronym="MCSPI_HL_SYSCONFIG" offset="16" width="32" description="Clock management configuration.">
		<bitfield id="IDLEMODE" width="2" begin="3" end="2" resetval="0x2" description="Configuration of the local target state management mode By definition, target can handle read/write transaction as long as it is out of IDLE state 0      Force-idle mode: local target's IDLE state       follows (acknowledges) the system's clock       stop requests unconditionally, that is,       regardless of the IP module's internal       requirements. Backup mode, for debug only.1      No-idle mode: local target never enters       IDLE state. Backup mode, for debug only.2      Smart-idle mode: local target's IDLE state       eventually follows (acknowledges) the       system's clock stop requests, depending on       the IP module's internal requirements. IP       module shall not generate (IRQ- or DMA-       request-related) wake-up events." range="3:2" rwaccess="R/W"/>
	<bitfield id="FREEEMU" width="1" begin="1" end="1" resetval="0x0" description="Sensitivity to emulation [debug] suspend input signal 0      IP module is sensitive to emulation       suspend.1      IP module is not sensitive to emulation       suspend." range="1" rwaccess="R/W"/>
	<bitfield id="SOFTRESET" width="1" begin="0" end="0" resetval="0x0" description="Software reset [Optional] 0      Read 0 - Reset done, no pending action0      Write 0 - No Action1      Read 1 - Reset(software or other) ongoing1      Write 1 - Initiate software reset" range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_REVISION" acronym="MCSPI_REVISION" offset="256" width="32" description="This register contains the hard coded RTL revision number. ">
		<bitfield id="RESERVED_13" width="24" begin="31" end="8" resetval="0x0" description="Reads returns 0" range="31:8" rwaccess="R"/>
	<bitfield id="REV" width="8" begin="7" end="0" resetval="0x43" description="IP revision [7:4] Major revision [3:0] Minor revision Examples: 0x10 for 10, 0x21 for 21" range="7:0" rwaccess="R"/>
	</register><register id="MCSPI_SYSSTATUS" acronym="MCSPI_SYSSTATUS" offset="276" width="32" description="This register provides status information about the module excluding the interrupt status information .">
		<bitfield id="RESERVED_16" width="31" begin="31" end="1" resetval="0x0" description="Reserved for module specific status information Read returns 0" range="31:1" rwaccess="R"/>
	<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="Internal Reset Monitoring 0      Internal module reset is ongoing1      Reset completed" range="0" rwaccess="R"/>
	</register><register id="MCSPI_IRQSTATUS" acronym="MCSPI_IRQSTATUS" offset="280" width="32" description="The interrupt status regroups all the status of the module internal events that can generate an interrupt .">
		<bitfield id="RESERVED_8" width="14" begin="31" end="18" resetval="0x0" description="Reads returns 0" range="31:18" rwaccess="R"/>
	<bitfield id="EOW" width="1" begin="17" end="17" resetval="0x0" description="End of word count event when a channel is enabled using the FIFO buffer and the channel had sent the number of SPI word defined by MCSPI_XFERLEVEL[WCNT]  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="17" rwaccess="R/W1TS"/>
	<bitfield id="WKS" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event in target mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="16" rwaccess="R/W1TS"/>
	<bitfield id="RESERVED_7" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="R"/>
	<bitfield id="RX3_FULL" width="1" begin="14" end="14" resetval="0x0" description="Receiver register is full or almost full Only when Channel 3 is enabled  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="14" rwaccess="R/W1TS"/>
	<bitfield id="TX3_UNDERFLOW" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register underflow Only when Channel 3 is enabled The transmitter register is empty [not updated by Host or DMA with new data] before its time slot assignment Exception: No TX_underflow event when no data has been loaded into the transmitter register since channel has been enabled  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="13" rwaccess="R/W1TS"/>
	<bitfield id="TX3_EMPTY" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register is empty or almost empty Note: Enabling the channel automatically rises this event  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="12" rwaccess="R/W1TS"/>
	<bitfield id="RESERVED_9" width="1" begin="11" end="11" resetval="0x0" description="Reads returns 0" range="11" rwaccess="R"/>
	<bitfield id="RX2_FULL" width="1" begin="10" end="10" resetval="0x0" description="Receiver register full or almost full Channel 2  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="10" rwaccess="R/W1TS"/>
	<bitfield id="TX2_UNDERFLOW" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register underflow Channel 2  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="9" rwaccess="R/W1TS"/>
	<bitfield id="TX2_EMPTY" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register empty or almost empty Channel 2  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="8" rwaccess="R/W1TS"/>
	<bitfield id="RESERVED_10" width="1" begin="7" end="7" resetval="0x0" description="Reads returns 0" range="7" rwaccess="R"/>
	<bitfield id="RX1_FULL" width="1" begin="6" end="6" resetval="0x0" description="Receiver register full or almost full Channel 1  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="6" rwaccess="R/W1TS"/>
	<bitfield id="TX1_UNDERFLOW" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register underflow Channel 1  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="5" rwaccess="R/W1TS"/>
	<bitfield id="TX1_EMPTY" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register empty or almost empty Channel 1  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="4" rwaccess="R/W1TS"/>
	<bitfield id="RX0_OVERFLOW" width="1" begin="3" end="3" resetval="0x0" description="Receiver register overflow [target mode only] Channel 0  0      Event status bit unchanged1      Event is pending" range="3" rwaccess="R/W1TS"/>
	<bitfield id="RX0_FULL" width="1" begin="2" end="2" resetval="0x0" description="Receiver register full or almost full Channel 0  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="2" rwaccess="R/W1TS"/>
	<bitfield id="TX0_UNDERFLOW" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register underflow Channel 0  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="1" rwaccess="R/W1TS"/>
	<bitfield id="TX0_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register empty or almost empty Channel 0  0      Read 0 - Event false0      Write 0 - Event status bit Unchanged1      Read 1 - Event is Pending1      Write 1 - Event status bit is reset" range="0" rwaccess="R/W1TS"/>
	</register><register id="MCSPI_IRQENABLE" acronym="MCSPI_IRQENABLE" offset="284" width="32" description="This register allows to enable/disable the module internal sources of interrupt, on an event-by-event basis. ">
		<bitfield id="RESERVED_5" width="14" begin="31" end="18" resetval="0x0" description="Reads return 0" range="31:18" rwaccess="R"/>
	<bitfield id="EOW_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="End of Word count Interrupt Enable 0      Interrupt disabled1      Interrupt enabled" range="17" rwaccess="R/W"/>
	<bitfield id="WKE" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event interrupt Enable in target mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV] 0      Interrupt disabled1      Interrupt enabled" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED_4" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="R"/>
	<bitfield id="RX3_FULL_ENABLE" width="1" begin="14" end="14" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 3 0      Interrupt disabled1      Interrupt enabled" range="14" rwaccess="R/W"/>
	<bitfield id="TX3_UNDERFLOW_ENABLE" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 3 0      Interrupt disabled1      Interrupt enabled" range="13" rwaccess="R/W"/>
	<bitfield id="TX3_EMPTY_ENABLE" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch3 0      Interrupt disabled1      Interrupt enabled" range="12" rwaccess="R/W"/>
	<bitfield id="RESERVED_6" width="1" begin="11" end="11" resetval="0x0" description="Reads return 0" range="11" rwaccess="R"/>
	<bitfield id="RX2_FULL_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 2 0      Interrupt disabled1      Interrupt enabled" range="10" rwaccess="R/W"/>
	<bitfield id="TX2_UNDERFLOW_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 2 0      Interrupt disabled1      Interrupt enabled" range="9" rwaccess="R/W"/>
	<bitfield id="TX2_EMPTY_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 2 0      Interrupt disabled1      Interrupt enabled" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED_3" width="1" begin="7" end="7" resetval="0x0" description="Reads return 0" range="7" rwaccess="R"/>
	<bitfield id="RX1_FULL_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 1 0      Interrupt disabled1      Interrupt enabled" range="6" rwaccess="R/W"/>
	<bitfield id="TX1_UNDERFLOW_ENABLE" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 1 0      Interrupt disabled1      Interrupt enabled" range="5" rwaccess="R/W"/>
	<bitfield id="TX1_EMPTY_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 1 0      Interrupt disabled1      Interrupt enabled" range="4" rwaccess="R/W"/>
	<bitfield id="RX0_OVERFLOW_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="Receiver register Overflow Interrupt Enable Ch 0 0      Interrupt disabled1      Interrupt enabled" range="3" rwaccess="R/W"/>
	<bitfield id="RX0_FULL_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 0 0      Interrupt disabled1      Interrupt enabled" range="2" rwaccess="R/W"/>
	<bitfield id="TX0_UNDERFLOW_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 0 0      Interrupt disabled1      Interrupt enabled" range="1" rwaccess="R/W"/>
	<bitfield id="TX0_EMPTY_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 0 0      Interrupt disabled1      Interrupt enabled" range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_WAKEUPENABLE" acronym="MCSPI_WAKEUPENABLE" offset="288" width="32" description="The wakeup enable register allows to enable/disable the module internal sources of wakeup on event-by-event basis. ">
		<bitfield id="RESERVED_18" width="31" begin="31" end="1" resetval="0x0" description="Reads returns 0" range="31:1" rwaccess="R"/>
	<bitfield id="WKEN" width="1" begin="0" end="0" resetval="0x0" description="WakeUp functionality in target mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV] 0      The event is not allowed to wake-up the       system, even if the global control bit       MCSPI_SYSCONFIG[2] ENAWAKEUPis set.1      The event is allowed to wake-up the system       if the global control bit       MCSPI_SYSCONFIG[2] ENAWAKEUP is set." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_SYST" acronym="MCSPI_SYST" offset="292" width="32" description="This register is used to check the correctness of the system interconnect either internally to peripheral bus, or externally to device IO pads, when the module is configured in system test (SYSTEST) mode. ">
		<bitfield id="RESERVED_17" width="20" begin="31" end="12" resetval="0x0" description="Reads returns 0" range="31:12" rwaccess="R"/>
	<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bit 0      No action. Writing 0 does not clear already       set status bits. This bit must be cleared       before trying to clear a status bit of the       MCSPI_IRQSTATUS register.1      Force to 1 all status bits of       MCSPI_IRQSTATUS register. Writing 1 into       this bit sets to 1 all status bits in the       MCSPI_IRQSTATUS register." range="11" rwaccess="R/W"/>
	<bitfield id="SPIENDIR" width="1" begin="10" end="10" resetval="0x0" description="Set the direction of the SPIEN[3:0] lines and SPICLK line 0      Output (as in controller mode)1      Input (as in peripheral mode)" range="10" rwaccess="R/W"/>
	<bitfield id="SPIDATDIR1" width="1" begin="9" end="9" resetval="0x0" description="Set the direction of the SPIDAT[1] 0      Output1      Input" range="9" rwaccess="R/W"/>
	<bitfield id="SPIDATDIR0" width="1" begin="8" end="8" resetval="0x0" description="Set the direction of the SPIDAT[0] 0      Output1      Input" range="8" rwaccess="R/W"/>
	<bitfield id="WAKD" width="1" begin="7" end="7" resetval="0x0" description="SWAKEUP output [signal data value of internal signal to system] The signal is driven high or low according to the value written into this register bit 0      The pin is driven low.1      The pin is driven high." range="7" rwaccess="R/W"/>
	<bitfield id="SPICLK" width="1" begin="6" end="6" resetval="0x0" description="SPICLK line [signal data value] If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the CLKSPI line [high or low], and a write into this bit has no effect If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the CLKSPI line is driven high or low according to the value written into this register" range="6" rwaccess="R/W"/>
	<bitfield id="SPIDAT_1" width="1" begin="5" end="5" resetval="0x0" description="SPIDAT[1] line [signal data value] If MCSPI_SYST[SPIDATDIR1] = 0 [output mode direction], the SPIDAT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR1] = 1 [input mode direction], this bit returns the value on the SPIDAT[1] line [high or low], and a write into this bit has no effect " range="5" rwaccess="R/W"/>
	<bitfield id="SPIDAT_0" width="1" begin="4" end="4" resetval="0x0" description="SPIDAT[0] line [signal data value] If MCSPI_SYST[SPIDATDIR0] = 0 [output mode direction], the SPIDAT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR0] = 1 [input mode direction], this bit returns the value on the SPIDAT[0] line [high or low], and a write into this bit has no effect " range="4" rwaccess="R/W"/>
	<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="R/W"/>
	<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="R/W"/>
	<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="R/W"/>
	<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_MODULCTRL" acronym="MCSPI_MODULCTRL" offset="296" width="32" description="This register is dedicated to the configuration of the serial port interface. ">
		<bitfield id="RESERVED_11" width="23" begin="31" end="9" resetval="0x0" description="Reads returns 0" range="31:9" rwaccess="R"/>
	<bitfield id="FDAA" width="1" begin="8" end="8" resetval="0x0" description="FIFO DMA Address 256-bit aligned This register is used when a FIFO is managed by the module and DMA connected to the controller provides only 256 bit aligned address If this bit is set the enabled channel which uses the FIFO has its datas managed through MCSPI_DAFTX and MCSPI_DAFRX registers instead of MCSPI_TX[i] and MCSPI_RX[i] registers 0      FIFO data managed by MCSPI_TX(i) and       MCSPI_RX(i) registers.1      FIFO data managed by MCSPI_DAFTX and       MCSPI_DAFRX registers." range="8" rwaccess="R/W"/>
