ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/MCSPI_MCSPI_52200000h.xml
	<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 'i' Transmitter Register Status 0      Register is full.1      Register is empty." range="1" rwaccess="R"/>
	<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 'i' Receiver Register Status 0      Register is empty.1      Register is full." range="0" rwaccess="R"/>
	</register><register id="MCSPI_CH1CTRL" acronym="MCSPI_CH1CTRL" offset="328" width="32" description="This register is dedicated to enable the channel 1">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31:16" rwaccess="R"/>
	<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is4096clock divider ratio 0      Clock ratio is CLKD + 1.1      Clock ratio is CLKD + 1 + 16.FF     Clock ratio is CLKD + 1 + 4080." range="15:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7:1" rwaccess="R"/>
	<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable 0      Channel i is not active.1      Channel i is active." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_TX1" acronym="MCSPI_TX1" offset="332" width="32" description="This register contains a single SPI word to transmit on the serial link,  what ever SPI word length is. ">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 Data to transmit" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_RX1" acronym="MCSPI_RX1" offset="336" width="32" description="This register contains a single SPI word received through the serial link, what ever SPI word length is. ">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 1 Received Data" range="31:0" rwaccess="R"/>
	</register><register id="MCSPI_CH2CONF" acronym="MCSPI_CH2CONF" offset="340" width="32" description="This register is dedicated to the configuration of the channel 2">
		<bitfield id="RESERVED_0" width="2" begin="31" end="30" resetval="0x0" description="Read returns 0" range="31:30" rwaccess="R"/>
	<bitfield id="CLKG" width="1" begin="29" end="29" resetval="0x0" description="Clock divider granularity This register defines the granularity of channel clock divider: power of two or one clock cycle granularity When this bit is set the register MCSPI_CHCTRL[EXTCLK] must be configured to reach a maximum of4096clock divider ratio Then The clock divider ratio is a concatenation of MCSPI_CHCONF[CLKD] and MCSPI_CHCTRL[EXTCLK] values 0      Clock granularity of power of 21      One clock cycle granularity" range="29" rwaccess="R/W"/>
	<bitfield id="FFER" width="1" begin="28" end="28" resetval="0x0" description="FIFO enabled for receive:Only one channel can have this bit field set 0      The buffer is not used to receive data.1      The buffer is used to receive data." range="28" rwaccess="R/W"/>
	<bitfield id="FFEW" width="1" begin="27" end="27" resetval="0x0" description="FIFO enabled for Transmit:Only one channel can have this bit field set 0      The buffer is not used to transmit data.1      The buffer is used to transmit data." range="27" rwaccess="R/W"/>
	<bitfield id="TCS2" width="2" begin="26" end="25" resetval="0x0" description="Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock 0      0.5 clock cycle1      1.5 clock cycles2      2.5 clock cycles3      3.5 clock cycles" range="26:25" rwaccess="R/W"/>
	<bitfield id="SBPOL" width="1" begin="24" end="24" resetval="0x0" description="Start bit polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="24" rwaccess="R/W"/>
	<bitfield id="SBE" width="1" begin="23" end="23" resetval="0x0" description="Start bit enable for SPI transfer 0      Default MCSPI transfer length as specified       by WL bit field1      Start bit D/CX added before MCSPI transfer       polarity is defined by MCSPI_CHCONF_0[24]       SBPOL" range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="22" end="21" resetval="0x0" description="Read returns 0" range="22:21" rwaccess="R"/>
	<bitfield id="FORCE" width="1" begin="20" end="20" resetval="0x0" description="Manual SPIEN assertion to keep SPIEN active between SPI words [single channel master mode only]  0      Writing 0 into this bit drives low the       SPIEN line when MCSPI_CHCONF_2[6] EPOL=0,       and drives it high when MCSPI_CHCONF_2[6]       EPOL=1.1      Writing 1 into this bit drives high the       SPIEN line when MCSPI_CHCONF_2[6] EPOL=0,       and drives it low when MCSPI_CHCONF_2[6]       EPOL=1." range="20" rwaccess="R/W"/>
	<bitfield id="TURBO" width="1" begin="19" end="19" resetval="0x0" description="Turbo mode 0      Turbo is deactivated (recommended for       single MCSPI word transfer).1      Turbo is activated to maximize the       throughput for multiple MCSPI words       transfer." range="19" rwaccess="R/W"/>
	<bitfield id="IS" width="1" begin="18" end="18" resetval="0x1" description="Input Select 0      Data line 0 (SPIDAT[0]) selected for       reception1      Data line 1 (SPIDAT[1]) selected for       reception" range="18" rwaccess="R/W"/>
	<bitfield id="DPE1" width="1" begin="17" end="17" resetval="0x1" description="Transmission Enable for data line 1 [SPIDATAGZEN[1]]  0      Data line 1 (SPIDAT[1]) selected for       transmission1      No transmission on Data Line1 (SPIDAT[1])" range="17" rwaccess="R/W"/>
	<bitfield id="DPE0" width="1" begin="16" end="16" resetval="0x0" description="Transmission Enable for data line 0 [SPIDATAGZEN[0]]  0      Data Line0 (SPIDAT[0]) selected for       transmission1      No transmission on data line 0 (SPIDAT[0])" range="16" rwaccess="R/W"/>
	<bitfield id="DMAR" width="1" begin="15" end="15" resetval="0x0" description="DMA Read request The DMA Read request line is asserted when the channel is enabled and a new data is available in the receive register of the channel The DMA Read request line is deasserted on read completion of the receive register of the channel 0      DMA read request disabled1      DMA read request enabled" range="15" rwaccess="R/W"/>
	<bitfield id="DMAW" width="1" begin="14" end="14" resetval="0x0" description="DMA Write request The DMA Write request line is asserted when The channel is enabled and the transmitter register of the channel is empty The DMA Write request line is deasserted on load completion of the transmitter register of the channel 0      DMA write request disabled1      DMA write request enabled" range="14" rwaccess="R/W"/>
	<bitfield id="TRM" width="2" begin="13" end="12" resetval="0x0" description="Transmit/Receive modes 0      Transmit-and-receive mode1      Receive-only mode2      Transmit-only mode3      Reserved" range="13:12" rwaccess="R/W"/>
	<bitfield id="WL" width="5" begin="11" end="7" resetval="0x0" description="SPI word length 0      Reserved1      Reserved2      Reserved3      The MCSPI word is 4 bits long4      The MCSPI word is 5 bits long5      The MCSPI word is 6 bits long6      The MCSPI word is 7 bits long7      The MCSPI word is 8 bits long8      The MCSPI word is 9 bits long9      The MCSPI word is 10 bits longA      The MCSPI word is 11 bits longB      The MCSPI word is 12 bits longC      The MCSPI word is 13 bits longD      The MCSPI word is 14 bits longE      The MCSPI word is 15 bits longF      The MCSPI word is 16 bits long10     The MCSPI word is 17 bits long11     The MCSPI word is 18 bits long12     The MCSPI word is 19 bits long13     The MCSPI word is 20 bits long14     The MCSPI word is 21 bits long15     The MCSPI word is 22 bits long16     The MCSPI word is 23 bits long17     The MCSPI word is 24 bits long18     The MCSPI word is 25 bits long19     The MCSPI word is 26 bits long1A     The MCSPI word is 27 bits long1B     The MCSPI word is 28 bits long1C     The MCSPI word is 29 bits long1D     The MCSPI word is 30 bits long1E     The MCSPI word is 31 bits long1F     The MCSPI word is 32 bits long" range="11:7" rwaccess="R/W"/>
	<bitfield id="EPOL" width="1" begin="6" end="6" resetval="0x0" description="SPIEN polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="6" rwaccess="R/W"/>
	<bitfield id="CLKD" width="4" begin="5" end="2" resetval="0x0" description="Frequency divider for SPICLK [only when the module is a Master SPI device] A programmable clock divider divides the SPI reference clock [CLKSPIREF] with a 4-bit value, and results in a new clock SPICLK available to shift-in and shift-out data By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared, Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] registerThe value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0 0      11      22      43      84      165      326      647      1288      2569      512A      1024B      2048C      4096D      8192E      16384F      32768" range="5:2" rwaccess="R/W"/>
	<bitfield id="POL" width="1" begin="1" end="1" resetval="0x0" description="SPICLK polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="1" rwaccess="R/W"/>
	<bitfield id="PHA" width="1" begin="0" end="0" resetval="0x0" description="SPICLK phase 0      Data are latched on odd-numbered edges of       SPICLK.1      Data are latched on even-numbered edges of       SPICLK." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_CH2STAT" acronym="MCSPI_CH2STAT" offset="344" width="32" description="This register provides status information about transmitter and receiver registers of channel 2">
		<bitfield id="RESERVED_2" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31:7" rwaccess="R"/>
	<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Full Status 0      FIFO receive buffer is not full1      FIFO receive buffer is full" range="6" rwaccess="R"/>
	<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Empty Status 0      FIFO receive buffer is not empty1      FIFO receive buffer is empty" range="5" rwaccess="R"/>
	<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Full Status 0      FIFO transmit buffer is not full1      FIFO transmit buffer is full" range="4" rwaccess="R"/>
	<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Empty Status 0      FIFO transmit buffer is not empty1      FIFO transmit buffer is empty" range="3" rwaccess="R"/>
	<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 'i' End of transfer Status The definitions of beginning and end of transfer vary with master versus target and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details 0      This flag is automatically cleared when the       shift register is loaded with the data from       the transmitter register (beginning of       transfer).1      This flag is automatically set to one at       the end of an MCSPI transfer." range="2" rwaccess="R"/>
	<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 'i' Transmitter Register Status 0      Register is full.1      Register is empty." range="1" rwaccess="R"/>
	<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 'i' Receiver Register Status 0      Register is empty.1      Register is full." range="0" rwaccess="R"/>
	</register><register id="MCSPI_CH2CTRL" acronym="MCSPI_CH2CTRL" offset="348" width="32" description="This register is dedicated to enable the channel 2">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31:16" rwaccess="R"/>
	<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is4096clock divider ratio 0      Clock ratio is CLKD + 1.1      Clock ratio is CLKD + 1 + 16.FF     Clock ratio is CLKD + 1 + 4080." range="15:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7:1" rwaccess="R"/>
	<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable 0      Channel i is not active.1      Channel i is active." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_TX2" acronym="MCSPI_TX2" offset="352" width="32" description="This register contains a single SPI word to transmit on the serial link,  what ever SPI word length is. ">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 Data to transmit" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_RX2" acronym="MCSPI_RX2" offset="356" width="32" description="This register contains a single SPI word received through the serial link, what ever SPI word length is. ">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 2 Received Data" range="31:0" rwaccess="R"/>
	</register><register id="MCSPI_CH3CONF" acronym="MCSPI_CH3CONF" offset="360" width="32" description="This register is dedicated to the configuration of the channel 3">
		<bitfield id="RESERVED_0" width="2" begin="31" end="30" resetval="0x0" description="Read returns 0" range="31:30" rwaccess="R"/>
	<bitfield id="CLKG" width="1" begin="29" end="29" resetval="0x0" description="Clock divider granularity This register defines the granularity of channel clock divider: power of two or one clock cycle granularity When this bit is set the register MCSPI_CHCTRL[EXTCLK] must be configured to reach a maximum of4096clock divider ratio Then The clock divider ratio is a concatenation of MCSPI_CHCONF[CLKD] and MCSPI_CHCTRL[EXTCLK] values 0      Clock granularity of power of 21      One clock cycle granularity" range="29" rwaccess="R/W"/>
	<bitfield id="FFER" width="1" begin="28" end="28" resetval="0x0" description="FIFO enabled for receive:Only one channel can have this bit field set 0      The buffer is not used to receive data.1      The buffer is used to receive data." range="28" rwaccess="R/W"/>
	<bitfield id="FFEW" width="1" begin="27" end="27" resetval="0x0" description="FIFO enabled for Transmit:Only one channel can have this bit field set 0      The buffer is not used to transmit data.1      The buffer is used to transmit data." range="27" rwaccess="R/W"/>
	<bitfield id="TCS3" width="2" begin="26" end="25" resetval="0x0" description="Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock 0      0.5 clock cycle1      1.5 clock cycles2      2.5 clock cycles3      3.5 clock cycles" range="26:25" rwaccess="R/W"/>
	<bitfield id="SBPOL" width="1" begin="24" end="24" resetval="0x0" description="Start bit polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="24" rwaccess="R/W"/>
	<bitfield id="SBE" width="1" begin="23" end="23" resetval="0x0" description="Start bit enable for SPI transfer 0      Default MCSPI transfer length as specified       by WL bit field1      Start bit D/CX added before MCSPI transfer       polarity is defined by MCSPI_CHCONF_0[24]       SBPOL" range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="22" end="21" resetval="0x0" description="Read returns 0" range="22:21" rwaccess="R"/>
	<bitfield id="FORCE" width="1" begin="20" end="20" resetval="0x0" description="Manual SPIEN assertion to keep SPIEN active between SPI words [single channel master mode only]  0      Writing 0 into this bit drives low the       SPIEN line when MCSPI_CHCONF_3[6] EPOL=0,       and drives it high when MCSPI_CHCONF_3[6]       EPOL=1.1      Writing 1 into this bit drives high the       SPIEN line when MCSPI_CHCONF_3[6] EPOL=0,       and drives it low when MCSPI_CHCONF_3[6]       EPOL=1." range="20" rwaccess="R/W"/>
	<bitfield id="TURBO" width="1" begin="19" end="19" resetval="0x0" description="Turbo mode 0      Turbo is deactivated (recommended for       single MCSPI word transfer).1      Turbo is activated to maximize the       throughput for multiple MCSPI words       transfer." range="19" rwaccess="R/W"/>
	<bitfield id="IS" width="1" begin="18" end="18" resetval="0x1" description="Input Select 0      Data line 0 (SPIDAT[0]) selected for       reception1      Data line 1 (SPIDAT[1]) selected for       reception" range="18" rwaccess="R/W"/>
	<bitfield id="DPE1" width="1" begin="17" end="17" resetval="0x1" description="Transmission Enable for data line 1 [SPIDATAGZEN[1]]  0      Data line 1 (SPIDAT[1]) selected for       transmission1      No transmission on Data Line1 (SPIDAT[1])" range="17" rwaccess="R/W"/>
	<bitfield id="DPE0" width="1" begin="16" end="16" resetval="0x0" description="Transmission Enable for data line 0 [SPIDATAGZEN[0]]  0      Data Line0 (SPIDAT[0]) selected for       transmission1      No transmission on data line 0 (SPIDAT[0])" range="16" rwaccess="R/W"/>
	<bitfield id="DMAR" width="1" begin="15" end="15" resetval="0x0" description="DMA Read request The DMA Read request line is asserted when the channel is enabled and a new data is available in the receive register of the channel The DMA Read request line is deasserted on read completion of the receive register of the channel 0      DMA read request disabled1      DMA read request enabled" range="15" rwaccess="R/W"/>
	<bitfield id="DMAW" width="1" begin="14" end="14" resetval="0x0" description="DMA Write request The DMA Write request line is asserted when The channel is enabled and the transmitter register of the channel is empty The DMA Write request line is deasserted on load completion of the transmitter register of the channel 0      DMA write request disabled1      DMA write request enabled" range="14" rwaccess="R/W"/>
	<bitfield id="TRM" width="2" begin="13" end="12" resetval="0x0" description="Transmit/Receive modes 0      Transmit-and-receive mode1      Receive-only mode2      Transmit-only mode3      Reserved" range="13:12" rwaccess="R/W"/>
	<bitfield id="WL" width="5" begin="11" end="7" resetval="0x0" description="SPI word length 0      Reserved1      Reserved2      Reserved3      The MCSPI word is 4 bits long4      The MCSPI word is 5 bits long5      The MCSPI word is 6 bits long6      The MCSPI word is 7 bits long7      The MCSPI word is 8 bits long8      The MCSPI word is 9 bits long9      The MCSPI word is 10 bits longA      The MCSPI word is 11 bits longB      The MCSPI word is 12 bits longC      The MCSPI word is 13 bits longD      The MCSPI word is 14 bits longE      The MCSPI word is 15 bits longF      The MCSPI word is 16 bits long10     The MCSPI word is 17 bits long11     The MCSPI word is 18 bits long12     The MCSPI word is 19 bits long13     The MCSPI word is 20 bits long14     The MCSPI word is 21 bits long15     The MCSPI word is 22 bits long16     The MCSPI word is 23 bits long17     The MCSPI word is 24 bits long18     The MCSPI word is 25 bits long19     The MCSPI word is 26 bits long1A     The MCSPI word is 27 bits long1B     The MCSPI word is 28 bits long1C     The MCSPI word is 29 bits long1D     The MCSPI word is 30 bits long1E     The MCSPI word is 31 bits long1F     The MCSPI word is 32 bits long" range="11:7" rwaccess="R/W"/>
	<bitfield id="EPOL" width="1" begin="6" end="6" resetval="0x0" description="SPIEN polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="6" rwaccess="R/W"/>
	<bitfield id="CLKD" width="4" begin="5" end="2" resetval="0x0" description="Frequency divider for SPICLK [only when the module is a Master SPI device] A programmable clock divider divides the SPI reference clock [CLKSPIREF] with a 4-bit value, and results in a new clock SPICLK available to shift-in and shift-out data By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared, Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] registerThe value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0 0      11      22      43      84      165      326      647      1288      2569      512A      1024B      2048C      4096D      8192E      16384F      32768" range="5:2" rwaccess="R/W"/>
	<bitfield id="POL" width="1" begin="1" end="1" resetval="0x0" description="SPICLK polarity 0      SPICLK is held low during the INACTIVE       state1      SPICLK is held high during the INACTIVE       state" range="1" rwaccess="R/W"/>
	<bitfield id="PHA" width="1" begin="0" end="0" resetval="0x0" description="SPICLK phase 0      Data are latched on odd-numbered edges of       SPICLK.1      Data are latched on even-numbered edges of       SPICLK." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_CH3STAT" acronym="MCSPI_CH3STAT" offset="364" width="32" description="This register provides status information about transmitter and receiver registers of channel 3">
		<bitfield id="RESERVED_2" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31:7" rwaccess="R"/>
	<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Full Status 0      FIFO receive buffer is not full1      FIFO receive buffer is full" range="6" rwaccess="R"/>
	<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Empty Status 0      FIFO receive buffer is not empty1      FIFO receive buffer is empty" range="5" rwaccess="R"/>
	<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Full Status 0      FIFO transmit buffer is not full1      FIFO transmit buffer is full" range="4" rwaccess="R"/>
	<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Empty Status 0      FIFO transmit buffer is not empty1      FIFO transmit buffer is empty" range="3" rwaccess="R"/>
	<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 'i' End of transfer Status The definitions of beginning and end of transfer vary with master versus target and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details 0      This flag is automatically cleared when the       shift register is loaded with the data from       the transmitter register (beginning of       transfer).1      This flag is automatically set to one at       the end of an MCSPI transfer." range="2" rwaccess="R"/>
	<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 'i' Transmitter Register Status 0      Register is full.1      Register is empty." range="1" rwaccess="R"/>
	<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 'i' Receiver Register Status 0      Register is empty.1      Register is full." range="0" rwaccess="R"/>
