ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/MCSPI_MCSPI_52200000h.xml
	</register><register id="MCSPI_CH3CTRL" acronym="MCSPI_CH3CTRL" offset="368" width="32" description="This register is dedicated to enable the channel 3">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31:16" rwaccess="R"/>
	<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is4096clock divider ratio 0      Clock ratio is CLKD + 1.1      Clock ratio is CLKD + 1 + 16.FF     Clock ratio is CLKD + 1 + 4080." range="15:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7:1" rwaccess="R"/>
	<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable 0      Channel i is not active.1      Channel i is active." range="0" rwaccess="R/W"/>
	</register><register id="MCSPI_TX3" acronym="MCSPI_TX3" offset="372" width="32" description="This register contains a single SPI word to transmit on the serial link,  what ever SPI word length is. ">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Data to transmit" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_RX3" acronym="MCSPI_RX3" offset="376" width="32" description="This register contains a single SPI word received through the serial link, what ever SPI word length is. ">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Received Data" range="31:0" rwaccess="R"/>
	</register><register id="MCSPI_XFERLEVEL" acronym="MCSPI_XFERLEVEL" offset="380" width="32" description="This register provides transfer levels needed while using FIFO buffer during transfer.">
		<bitfield id="WCNT" width="16" begin="31" end="16" resetval="0x0" description="Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO bufferWhen transfer had started, a read back in this register returns the current SPI word transfer index 0      Counter not used1      One wordFFFE   65534 MCSPI wordFFFF   65535 MCSPI word" range="31:16" rwaccess="R/W"/>
	<bitfield id="AFL" width="8" begin="15" end="8" resetval="0x0" description="Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes, then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1The size of this register is defined by the generic parameter FFNBYTE 0      1 byte1      2 bytesFE     255bytesFF     256bytes" range="15:8" rwaccess="R/W"/>
	<bitfield id="AEL" width="8" begin="7" end="0" resetval="0x0" description="Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes, then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1 0      1 byte1      2 bytesFE     255 bytesFF     256bytes" range="7:0" rwaccess="R/W"/>
	</register><register id="MCSPI_DAFTX" acronym="MCSPI_DAFTX" offset="384" width="32" description="This register contains the  SPI words to transmit on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_TX(i) register corresponding to the channel which have its FIFO enabled.">
		<bitfield id="DAFTDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31:0" rwaccess="R/W"/>
	</register><register id="MCSPI_DAFRX" acronym="MCSPI_DAFRX" offset="416" width="32" description="This register contains the  SPI words to received on the serial link when FIFO used and DMA address is aligned on 256 bit.This register is an image of one of MCSPI_RX(i) register corresponding to the channel which have its FIFO enabled.">
		<bitfield id="DAFRDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31:0" rwaccess="R"/>
	</register>
</module>